#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "road-warrior-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "road-warrior-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "road-warrior-nic-ip-config"
          + primary                                       = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + subnet_id                                     = (known after apply)
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "road-warrior-rg"
      + tags     = (known after apply)
    }

  # azurerm_subnet.internal will be created
  + resource "azurerm_subnet" "internal" {
      + address_prefix       = "10.0.140.0/24"
      + id                   = (known after apply)
      + ip_configurations    = (known after apply)
      + name                 = "internal"
      + resource_group_name  = "road-warrior-rg"
      + virtual_network_name = "road-warrior-network"
    }

  # azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "road-warrior-vm"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "road-warrior-rg"
      + tags                             = {
          + "environment" = "test"
        }
      + vm_size                          = "Standard_A0"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "koch"
          + computer_name  = "road-warrior-vm"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCjo9/Fgorf/Ul8Aynb9VihKj0HPeCpL2wkLcqjnNuCcara5/LNRmzhAtuoytVODiwcat3/S9OscZPpO9gZegwk9XddXCZiYrwB/Jr5lr9D+GYXyBb9uJm/aO8ttUy6wh80veFyC0L7d0Va+9cdXZ4X/p5v3lRdywLwx1flCsr0HS4F9gd4J4eIQ0WgEbFO0fPIWFVuVeE7WFa4u06DPl6QAGRF2bPYhG6aapAr7JtnPW9C1NcoYCZ76N2iN8uq+pAtePdWA1P+jLrCRGuouye9bd8+pNsS31B7qaIbufwmyuq3bQIImO9eAlZJ0IMCjQfa7kOml7LfVD01CnhIKwcN koch@BATTLEBOX"
              + path     = "/home/koch/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "road-warrior-vm-disk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.0.140.0/22",
        ]
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "road-warrior-network"
      + resource_group_name = "road-warrior-rg"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform - Verification`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
